Repository: 84000/data-translation-memory
Catalog: toh215-v3.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ་ལ་གདམས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Mahāyāna Sūtra Advice to a King (2) Advice to Udayana, King of Vatsa

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་ཆེན་པོ་བཱ་རཱ་ཎ་སཱི་ན་འཁོར་རྣམས་ལ་ཆོས་སྟོན་པ་ན། བད་ས་ལའི་རྒྱལ་པོ་འཆར་བྱེད་འདུལ་བའི་དུས་ལ་བབ་པར་གཟིགས་ནས་འཁོར་དང་བཅས་པ་བད་ས་ལའི་ཡུལ་དུ་གཤེགས་པ་དང་།
en: When the Blessed One was teaching the Dharma to his retinues in the great city of Vārāṇasī, he saw that the time had come to train Udayana, the king of Vatsa.

source: བད་ས་ལའི་རྒྱལ་པོ་འཆར་བྱེད་གྲོང་ཁྱེར་ཆེན་པོ་གསེར་ཅན་ཞེས་བྱ་བ་གཞོམ་པའི་ཕྱིར་དམག་བཞི་དང་ཆས་པ་དང་ཕྲད་པས་རྒྱལ་པོ་འཆར་བྱེད་ཁྲོས་ཏེ།
en: So, along with his retinues, he departed for Vatsa. When he encountered Udayana, the king of Vatsa, the king was setting out with his four armies to conquer the great city called Place of Gold. However, King Udayana became angry.

source: འདི་འདྲ་བའི་བཀྲ་མི་ཤིས་པ་དང་ཕྲད་པས་བསད་པར་རིགས་སོ་ཞེས་ནས་མདའ་སྟེའུ་ཁ་ཉ་རྔ་མ་བླངས་ཏེ།
en: “Such an inauspicious encounter!” he exclaimed. “I should kill him!”

source: བཅོམ་ལྡན་འདས་ལ་འཕངས་སོ། །
en: And with this he drew a sharp, fishtail-headed arrow and released it at the Blessed One.

source: དེ་ནས་མདའ་དེ་ནམ་མཁའ་ལ་འཁོར་ཞིང་འདི་སྐད་ཅེས་གྲག་གོ། །ཞེ་སྡང་གིས་ནི་སྡུག་བསྔལ་སྐྱེད། །
en: However, the arrow spun in the sky and a voice rang out, proclaiming: “Anger produces suffering.

source: འདིར་ཡང་ཤ་ཐང་འཐབ་དང་རྩོད། །ཕྱི་མར་དམྱལ་བའི་སྡུག་བསྔལ་འབྱུང་། །
en: In this life, it leads to exhaustion, conflict, and fighting, And in the next life, to the sufferings of hell.

source: དེས་ན་ཞེ་སྡང་འཐབ་རྩོད་སྤང་། །
en: Therefore, abandon anger, conflict, and fighting.”

source: ཞེས་བྱ་བའི་ཚིག་དེ་རྒྱལ་པོ་འཆར་བྱེད་ཀྱིས་ཐོས་པར་གྱུར་པ་དང་། བཅོམ་ལྡན་འདས་ལ་མོས་པར་གྱུར་ཏེ་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: On hearing these words, King Udayana became devoted to the Blessed One, prostrated, and sat down to one side.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་འཐབ་རྩོད་ནི་འདིར་ཤ་ཐང་ལ་ཕྱི་མར་ངན་སོང་དུ་སྐྱེ་ན་ཅིའི་ཕྱིར་རྟག་ཏུ་འཐབ་རྩོད་འབའ་ཞིག་བྱེད། རྒྱལ་པོས་གསོལ་པ།
en: Then the Blessed One said, “Great King, conflict and fighting lead to exhaustion, both here, now, and later in the lower realms, so why do you always do nothing but fight and create conflict?”

source: གཽཏ་མ་བདག་གིས་གང་དང་འཐབས་ཀྱང་ཕམ་མ་མྱོང་སྟེ་རྒྱལ་བས་བདག་ནི་དམག་དང་འཐབ་པ་ལ་མོས་པ་ལགས་སོ། །
en: “Gautama,” replied the king, “no matter whom I fight, I never experience defeat. Since I am always victorious, I am inclined toward fighting and warfare.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དགྲ་འདི་ནི་དགྲ་ཆུང་ངུ་ཡིན་ཏེ།
en: The Blessed One said, “Great King, these are lesser foes.

source: རྒྱལ་པོ་ཆེན་པོ་འདི་མ་ཡིན་པའི་དགྲ་ཆེན་པོ་ཤར་གཉེར་བ་ཞིག་ཡོད་དོ། །
en: Great King, there is another enemy, far greater and more hostile than them.”

source: རྒྱལ་པོས་གསོལ་པ་དགྲ་དེ་གང་ལགས།
en: “Who is that enemy?” asked the king.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགྲ་ཆེན་པོ་ཉོན་མོངས་པ་བདག་ཏུ་འཛིན་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དོ། །
en: The Blessed One replied, “This great enemy is called the affliction of perceiving a self.”

source: རྒྱལ་པོས་གསོལ་པ་དགྲ་དེ་ཇི་ལྟ་བུ་ལགས་བཤད་དུ་གསོལ།
en: The king said, “Please explain. What is this enemy like?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྣམ་རྟོག་བདག་ཏུ་འཛིན་པའི་དགྲ་ཆེན་པོ། །
en: The Blessed One replied: “The thought that perceives a self is the great enemy.

source: འདི་ནི་རྒྱུ་བཞིན་དངོས་པོ་མེད་བཞིན་དུ། །ཐོག་མ་མེད་ནས་བདག་ལ་གནས་ནས་ནི། །
en: While it is immaterial and without substance, It has dwelt with you since beginningless time.

source: བདག་གི་ཆོས་སྐུ་ཡིད་བཞིན་རིན་ཆེན་དེ། །གཟོད་མའི་མུ་ནས་དགྲ་ཡིས་བརྐུས་ནས་སུ། །མཚན་མའི་ཚང་ཚིང་གསེབ་ཏུ་སྦས་ནས་བདག །
en: “Since the very beginning, this enemy has stolen The wish-fulfilling jewel of dharmakāya And hidden it in the dense thicket of dualistic images.

source: ད་རུང་འཆིང་ཞིང་འཁོར་བར་འཁྱམ་དུ་འཇུག །
en: Even now it binds you still and forces you to wander in saṃsāra.

source: འཇིག་རྟེན་དགྲས་ནི་བསད་ནས་ནོར་འཕྲོག་ཙམ། །དེ་ལ་བཟོད་བྱས་བསོད་ནམས་ཚོགས་ཀྱང་རྫོགས། །
en: “Worldly enemies can do no more than kill and rob one’s wealth, And forbearance toward them can fill one’s store of merit.

source: དགྲ་འདི་ཞི་བདེ་ཐར་པའི་སྲོག་ཀྱང་གཅོད། །དེ་བསྟེན་བསོད་ནམས་འཁོར་བར་འདམ་དུ་འཆིང་། །
en: But this enemy will kill peace, happiness, and liberation; Associating with it, one’s merit becomes mired in the swamp of saṃsāra.”

source: རྒྱལ་པོས་གསོལ་པ། དགྲ་ཆེན་པོ་དེ་དང་ཇི་ལྟར་འཐབ་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The king asked, “How can one fight this great enemy?”

source: རྣམ་རྟོག་དགྲ་ལ་རྒོལ་བའི་ཤོམ་ར་ཡང་། །དད་པས་སྦྱིན་དང་ཚུལ་ཁྲིམས་མཁར་བརྩིགས་ཏེ། །དགེ་བའི་དཔུང་བྱས་བཟོད་པའི་གོ་གྱོན་ལ། །བརྩོན་འགྲུས་ལྕག་ཐོགས་བསམ་གཏན་གཞུ་བདུངས་ཏེ། །བདག་མེད་སྟོང་པའི་མདའ་ཡིས་བདག་འཛིན་བསད། །
en: The Blessed One replied: “To counter the enemy of conceptuality, With faith you must build a fortress of generosity and discipline, Then gather an army of virtue, don the armor of forbearance, Brandish the whip of perseverance, draw the bow of concentration, And slay the perception of a self with the arrow of nonself and emptiness.”

source: རྒྱལ་པོས་གསོལ་པ་བདག་མེད་པ་ཞེས་པ་དེ་བཤད་དུ་གསོལ།
en: The king said, “Please explain what you mean by ‘nonself.’ ”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་ཟག་བདག་མེད་རྒྱལ་པོ་མཉན་པར་གྱིས། །
en: The Blessed One replied: “On the idea that persons have no self, listen, O King!

source: གང་ཟག་ལྔ་ཕུང་རྒྱུན་ཡིན་ཅི་ཕྱིར་ན། །
en: “How is it that a person is a continuity of the five aggregates?

source: རྒྱུ་ནི་ལས་དང་ཉོན་མོངས་པས་གང་ནས། །འབྲས་བུ་ཕུང་པོར་ཟག་སྟེ་དེ་ཡི་བདག །
en: Due to the cause, which is being filled by karma and the afflictions, The result flows out in the form of the five aggregates and their ‘self.’

source: བདག་ནི་སེམས་ཅན་སོ་སོའི་ལུས་འདི་ལ། །ང་དང་བདག་ཏུ་བཟུང་ནས་ཆགས་གྱུར་ཏེ། །
en: “Beings become attached to this self, As they take their own bodies to be ‘me’ and ‘I.’

source: བདག་ནི་ན་དང་ཤི་བཀྲེས་གྲང་གིས་དོགས། །
en: This ‘self’ fears sickness, death, hunger, and cold.

source: བསྟོད་ན་དགའ་ཞིང་སྨད་ན་མི་དགའ་སྟེ། །
en: It is pleased by praise and upset by reproach.

source: དེ་ལ་དམིགས་ནས་མུ་སྟེགས་ལྔ་རྣམས་འཇུག །ང་འམ་བདག་དེ་ཡོད་པ་མ་ཡིན་ཏེ། །
en: “By apprehending a self, one joins the five rival traditions, Yet this ‘I’ and ‘self’ do not exist.

source: ཕུང་པོ་འདི་ལ་བརྟགས་ནས་འཁྲུལ་པ་ཡིན། །
en: Imputed upon the aggregates, they are delusion.

source: མིང་ནི་བདག་མ་ཡིན་ཏེ་བཏགས་པ་ཙམ། །
en: A name is not the self, but merely a label.

source: ལུས་ནི་བདག་མ་ཡིན་ཏེ་ཤ་རུས་རྣམས། །འབྱུང་ཆེན་འདུས་པ་ཕྱི་རོལ་རྩིག་པ་འདྲ། །
en: “The body is not the self, but flesh and bone— A gathering of great elements like an outer wall.

source: སེམས་ཀྱང་བདག་མ་ཡིན་ཏེ་དངོས་པོ་མེད། །
en: Not even mind is the self, because it has no substance.

source: ཆོས་ལ་བདག་མེད་རྒྱལ་པོ་མཉན་པར་གྱིས། །
en: “On the idea that phenomena have no self, listen, O King!

source: ཆོས་ནི་གཟུགས་སོགས་དངོས་པོ་ཐམས་ཅད་ཡིན། །བྱེད་པ་མེད་ལ་མཚན་ཉིད་འཛིན་ཕྱིར་རོ། །དེ་དག་ལོག་རྟོག་མཚན་མར་བཅས་པ་དང་། །
en: “Phenomena refers to all things, such as material form and so on, Since they do not act and they retain defining characteristics.

source: ལྟ་མི་འཐུན་པ་ཡིན་ཏེ་དེ་མེད་དོ། །
en: They are false notions that involve dualistic images, And are contrary to what they seem—they do not exist.

source: ཅི་ཕྱིར་ཞེ་ན་ཕྱི་ནང་ཆོས་འདི་ལ། །དངོས་འདི་སྤངས་ནས་སྟོང་ཉིད་མི་བཙལ་གྱི། །སྣང་བ་ཉིད་ན་སྟོང་པ་ཉིད་ཡིན་ཕྱིར། །
en: “If you wonder why, regarding outer and inner phenomena, One should not search for emptiness by rejecting entities, Because emptiness is already there in the appearances themselves.

source: གཞིག་བཅོམ་མི་རྟག་ཙམ་ལ་སྟོང་མིང་གདགས། །
en: The term emptiness applies precisely to what is breakable, destructible, and impermanent.

source: སྣང་ལ་རང་བཞིན་མེད་པར་ཅིས་མངོན་ན། །
en: “Apparent but without intrinsic nature, how do phenomena manifest?

source: ཡོད་མེད་དབུས་དང་གསུམ་དུ་མི་གནས་ཏེ། །
en: They do not abide as existent, nonexistent, or anything in between.

source: ཡོད་པར་གྲགས་པ་འཁོར་བ་མྱ་ངན་འདས། །
en: That which is said to exist is saṃsāra and nirvāṇa.

source: འཁོར་བའི་རང་བཞིན་ཡུལ་སེམས་རྣམ་གཉིས་ཏེ། །
en: The nature of saṃsāra consists of mind and its objects.

source: ཡུལ་འདི་དངོས་པོ་མེད་པར་འདི་ལྟར་བརྟག །རང་སྣང་རྡུལ་བཤིག་རྡུལ་ཡང་ཆས་གཞིག་མེད། །
en: “You should analyze objects to be unreal in this way: Divide appearances into particles—particles that cannot be divided further.

source: དངོས་སྣང་ཐམས་ཅད་སེམས་ཡིན་རྨི་ལམ་བཞིན། །
en: All appearances of entities are the mind, like a dream.

source: སེམས་ཀྱང་ཁ་དོག་དབྱིབས་སོགས་རྣམས་དང་བྲལ། །
en: And the mind, too, has no color, shape, and so on.

source: དེས་ན་འཁོར་བ་སྟོང་ཞིང་བདག་མེད་དོ། །
en: “So, saṃsāra is empty and devoid of a self.

source: འཁོར་བ་མེད་པས་མྱ་ངན་འདས་པའང་མེད། །
en: And since there is no saṃsāra, there is also no nirvāṇa.

source: ཡོད་པ་མ་གྲུབ་པས་ན་མེད་པའང་མེད། །
en: If existence is not established, then there is also no absence.

source: མཐའ་གཉིས་མེད་ཕྱིར་དབུས་ཀྱང་མེད་པ་ཡིན། །
en: And because neither of these two extremes exist, nor is there anything in between.

source: དེ་ལྟར་རྒྱལ་པོས་བདག་མེད་བསྒོམ་བྱས་ན། །བདག་འཛིན་འཁོར་བ་རྩད་ནས་ཆོད་པར་འགྱུར། །
en: “Thus, O King, if you meditate on nonself, Saṃsāra and perceiving a self will be cut at the root.”

source: རྒྱལ་པོས་གསོལ་པ། སྔ་གོང་ཡན་ཆད་དགྲ་མ་ཡིན་པ་ལ་དགྲར་བཟུང་སྟེ་བདག་ཞེ་སྡང་གིས་མནར་བར་གྱུར་ཏོ། །
en: The king said, “Previously, up until now, I have seen enemies where there were none, and I have been tormented by anger.

source: ད་ནི་བདག་གིས་ཡང་དག་པའི་དགྲ་ངོ་ཤེས་པས་དགྲ་དེ་དང་འཐབ་པའི་ཕྱིར་བདག་མེད་པ་ལ་མོས་པར་གྱུར་ལགས་སོ། །
en: Now that I have recognized the true enemy, I will be devoted to nonself to fight that enemy.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ལེགས་སོ། །
en: “Great King, excellent,” said the Blessed One.

source: བདག་ཏུ་འཛིན་པའི་དགྲ་ཕམ་པར་བྱས་སོ། །
en: “You have vanquished the enemy of perceiving a self.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བད་སའི་རྒྱལ་པོ་འཆར་བྱེད་ལ་སོགས་པ་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: Thus spoke the Blessed One, and King Udayana of Vatsa and the others rejoiced and praised what the Blessed One had said.

source: བད་ས་ལའི་རྒྱལ་པོ་འཆར་བྱེད་ལ་གདམས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the Mahāyāna sūtra “Advice to Udayana, King of Vatsa.”

source: རྒྱ་གར་གྱི་མཁན་པོ་དཱ་ན་ཤཱི་ལ་དང་། བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ། །
en: Translated, edited, and finalized by the Indian preceptor Dānaśīla and Bandé Yeshé Dé.
